In [144]:
import pandas as pd
import numpy as np
%matplotlib inline

In [145]:
df = pd.read_csv(r'C:\Users\kubas\AnacondaProjects\Lab_2\Original Data\drinks.csv')

In [146]:
df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [147]:
#Zmiana nazw kolumn
df.rename(columns={'beer_servings': 'beer_portions', 'spirit_servings': 'vodka_portions','wine_servings': 'wine_portions'}, inplace=True)

In [148]:
# Podzielenie alkholi na osobne wiersze 
df.set_index('country',inplace=True)
df = df.stack()
df.index = df.index.rename('type of alcohol', level=1)
df.name = 'Amount'
df = df.reset_index()

In [149]:
df.head(5)

       country               type of alcohol  Amount
0  Afghanistan                 beer_portions     0.0
1  Afghanistan                vodka_portions     0.0
2  Afghanistan                 wine_portions     0.0
3  Afghanistan  total_litres_of_pure_alcohol     0.0
4      Albania                 beer_portions    89.0

In [150]:
df.describe()

           Amount
count  772.000000
mean    60.330829
std     86.661937
min      0.000000
25%      2.200000
50%     11.000000
75%     93.000000
max    438.000000

In [151]:
df.to_csv(r'C:\Users\kubas\AnacondaProjects\Lab_2\Analysis Data\drinks_final.csv')